In [11]:
import pandas as pd

In [60]:
coffee=pd.read_csv('./warmup-data/coffee.csv')

In [13]:
coffee.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35

In [14]:
results=pd.read_parquet('./data/results.parquet')

In [15]:
results.head()

,year,type,discipline,event,as,athlete_id,noc,team,place,tied,medal
0,1912.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-François Blanchy,1,FRA,NaN,17.0,True,NaN
1,1912.0,Summer,Tennis,"Doubles, Men (Olympic)",Jean-François Blanchy,1,FRA,Jean Montariol,NaN,False,NaN
2,1920.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-François Blanchy,1,FRA,NaN,32.0,True,NaN
3,1920.0,Summer,Tennis,"Doubles, Mixed (Olympic)",Jean-François Blanchy,1,FRA,Jeanne Vaussard,8.0,True,NaN
4,1920.0,Summer,Tennis,"Doubles, Men (Olympic)",Jean-François Blanchy,1,FRA,Jacques Brugnon,4.0,False,NaN

Read excel file

In [9]:
olympics = pd.read_excel('.\data\olympics-data.xlsx')

<>:1: SyntaxWarning: invalid escape sequence '\d'
<>:1: SyntaxWarning: invalid escape sequence '\d'
C:\Users\User\AppData\Local\Temp\ipykernel_13232\3527476268.py:1: SyntaxWarning: invalid escape sequence '\d'
  olympics = pd.read_excel('.\data\olympics-data.xlsx')

In [10]:
olympics.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25

Read specific sheet from and excel file

In [21]:
olympics1 = pd.read_excel('.\data\olympics-data.xlsx' , sheet_name="results")

<>:1: SyntaxWarning: invalid escape sequence '\d'
<>:1: SyntaxWarning: invalid escape sequence '\d'
C:\Users\User\AppData\Local\Temp\ipykernel_13232\602659888.py:1: SyntaxWarning: invalid escape sequence '\d'
  olympics1 = pd.read_excel('.\data\olympics-data.xlsx' , sheet_name="results")

In [18]:
olympics1.head()

,year,type,discipline,event,as,athlete_id,noc,team,place,tied,medal
0,1912.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-François Blanchy,1,FRA,NaN,17.0,True,NaN
1,1912.0,Summer,Tennis,"Doubles, Men (Olympic)",Jean-François Blanchy,1,FRA,Jean Montariol,NaN,False,NaN
2,1920.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-François Blanchy,1,FRA,NaN,32.0,True,NaN
3,1920.0,Summer,Tennis,"Doubles, Mixed (Olympic)",Jean-François Blanchy,1,FRA,Jeanne Vaussard,8.0,True,NaN
4,1920.0,Summer,Tennis,"Doubles, Men (Olympic)",Jean-François Blanchy,1,FRA,Jacques Brugnon,4.0,False,NaN

In [24]:
bios = pd.read_csv('./data/bios.csv')

Accessing Data with Pandas

In [50]:
coffee

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          15
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

filter by rows and columns

In [51]:
#Coffee.loc[Rows,Columns]

coffee.loc[8]

Day              Friday
Coffee Type    Espresso
Units Sold           45
Name: 8, dtype: object

In [52]:
#Coffee.loc[Rows,Columns]

coffee.loc[8,["Day"]]

Day    Friday
Name: 8, dtype: str

In [53]:
#Row: = Row inwards

#Coffee.loc[Rows,Columns]

coffee.loc[8:]

         Day Coffee Type  Units Sold
8     Friday    Espresso          45
9     Friday       Latte          35
10  Saturday    Espresso          45
11  Saturday       Latte          35
12    Sunday    Espresso          45
13    Sunday       Latte          35

In [54]:
#Coffee.loc[Rows,Columns]
#Filter by rows and columns with rows inward

coffee.loc[0:,["Day" , "Coffee Type"]]

          Day Coffee Type
0      Monday    Espresso
1      Monday       Latte
2     Tuesday    Espresso
3     Tuesday       Latte
4   Wednesday    Espresso
5   Wednesday       Latte
6    Thursday    Espresso
7    Thursday       Latte
8      Friday    Espresso
9      Friday       Latte
10   Saturday    Espresso
11   Saturday       Latte
12     Sunday    Espresso
13     Sunday       Latte

In [56]:
coffee.index=coffee["Day"]

In [59]:
coffee.loc["Wednesday":"Friday" , "Units Sold"]

Day
Wednesday    35
Wednesday    25
Thursday     40
Thursday     30
Friday       45
Friday       35
Name: Units Sold, dtype: int64

Modifying Table Data

In [64]:
coffee

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          15
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          55

In [76]:
coffee.loc[12 , "Units Sold"] = 60

In [77]:
coffee

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          15
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          60
13     Sunday       Latte          55

In [80]:
coffee.loc[1:5 , "Units Sold"]=10

In [81]:
coffee

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          10
2     Tuesday    Espresso          10
3     Tuesday       Latte          10
4   Wednesday    Espresso          10
5   Wednesday       Latte          10
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          60
13     Sunday       Latte          55

Sorting Data

In [83]:
coffee.sort_values("Units Sold" , ascending=False)

          Day Coffee Type  Units Sold
12     Sunday    Espresso          60
13     Sunday       Latte          55
10   Saturday    Espresso          45
8      Friday    Espresso          45
6    Thursday    Espresso          40
9      Friday       Latte          35
11   Saturday       Latte          35
7    Thursday       Latte          30
0      Monday    Espresso          25
5   Wednesday       Latte          10
1      Monday       Latte          10
4   Wednesday    Espresso          10
3     Tuesday       Latte          10
2     Tuesday    Espresso          10

In [88]:
coffee.sort_values(["Units Sold" , "Coffee Type"] , ascending=[1,1])

          Day Coffee Type  Units Sold
2     Tuesday    Espresso          10
4   Wednesday    Espresso          10
1      Monday       Latte          10
3     Tuesday       Latte          10
5   Wednesday       Latte          10
0      Monday    Espresso          25
7    Thursday       Latte          30
9      Friday       Latte          35
11   Saturday       Latte          35
6    Thursday    Espresso          40
8      Friday    Espresso          45
10   Saturday    Espresso          45
13     Sunday       Latte          55
12     Sunday    Espresso          60

Using a for loop to iterate through Data Frames

In [89]:
for index , row in coffee.iterrows():
    print(index)
    print(row)
    print("\n\n\n\n\n\n")

0
Day              Monday
Coffee Type    Espresso
Units Sold           25
Name: 0, dtype: object







1
Day            Monday
Coffee Type     Latte
Units Sold         10
Name: 1, dtype: object







2
Day             Tuesday
Coffee Type    Espresso
Units Sold           10
Name: 2, dtype: object







3
Day            Tuesday
Coffee Type      Latte
Units Sold          10
Name: 3, dtype: object







4
Day            Wednesday
Coffee Type     Espresso
Units Sold            10
Name: 4, dtype: object







5
Day            Wednesday
Coffee Type        Latte
Units Sold            10
Name: 5, dtype: object







6
Day            Thursday
Coffee Type    Espresso
Units Sold           40
Name: 6, dtype: object







7
Day            Thursday
Coffee Type       Latte
Units Sold           30
Name: 7, dtype: object







8
Day              Friday
Coffee Type    Espresso
Units Sold           45
Name: 8, dtype: object







9
Day            Friday
Coffee Type     Latte
Units Sold         35
Name: 9, dtype: object







10
Day            Saturday
Coffee Type    Espresso
Units Sold           45
Name: 10, dtype: object







11
Day            Saturday
Coffee Type       Latte
Units Sold           35
Name: 11, dtype: object







12
Day              Sunday
Coffee Type    Espresso
Units Sold           60
Name: 12, dtype: object







13
Day            Sunday
Coffee Type     Latte
Units Sold         55
Name: 13, dtype: object

Iterating through a specific row

In [92]:
for index , row in coffee.iterrows():
    print(index)
    print(row["Units Sold"])
    print("\n\n\n\n\n\n")

0
25







1
10







2
10







3
10







4
10







5
10







6
40







7
30







8
45







9
35







10
45







11
35







12
60







13
55

Advanced Data Filtering

In [94]:
bios.head(10)

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25
5,6,Nicolas Chatelain,1970-01-13,Amiens,Somme,FRA,France,181.0,70.0,NaN
6,7,Patrick Chila,1969-11-27,Ris-Orangis,Essonne,FRA,France,180.0,73.0,NaN
7,8,Henri Cochet,1901-12-14,Villeurbanne,Rhône,FRA,France,NaN,NaN,1987-04-02
8,9,Marcel Cousin,1896-08-04,Nîmes,Gard,FRA,France,NaN,NaN,1986-08-01
9,10,Guy de la Chapelle,1868-07-16,Farges-Allichamps,Cher,FRA,France,NaN,NaN,1923-08-27

In [ ]:
bios[bios["height_cm"]>220]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
5673,5696,Gunther Behnke,1963-01-19,Leverkusen,Nordrhein-Westfalen,GER,Germany,221.0,114.0,NaN
5781,5804,Tommy Burleson,1952-02-24,Crossnore,North Carolina,USA,United States,223.0,102.0,NaN
6978,7013,Arvydas Sabonis,1964-12-19,Kaunas,Kaunas,LTU,Lithuania Soviet Union,223.0,122.0,NaN
89070,89782,Yao Ming,1980-09-12,Xuhui District,Shanghai,CHN,People's Republic of China,226.0,141.0,NaN
89075,89787,Roberto Dueñas,1975-11-01,Madrid,Madrid,ESP,Spain,221.0,137.0,NaN
120266,122147,Zhang Zhaoxu,1987-11-18,Binzhou,Shandong,CHN,People's Republic of China,221.0,110.0,NaN

In [106]:
bios.loc[bios["height_cm"]>210 , ["name" ,"born_country" ,"height_cm"]]

                         name born_country  height_cm
5089       Viktor Pankrashkin          RUS      220.0
5572          Santiago Aldama          ESP      213.0
5583     Paulinho Villas Boas          BRA      217.0
5599        Vladimir Andreyev          RUS      215.0
5609          Franjo Arapović          NaN      211.0
...                       ...          ...        ...
140298       Aaron Geramipoor          GBR      214.0
141018          Yuta Watanabe          JPN      215.0
142044          Jahlil Okafor          USA      211.0
142930             Mike Tobey          USA      213.0
143712           JaVale McGee          USA      213.0

[150 rows x 3 columns]

In [107]:
bios.loc[(bios["height_cm"]>210) & (bios["born_country"]=="USA") , ["name", "height_cm" , "born_country"]]

                      name  height_cm born_country
5681          Walt Bellamy      211.0          USA
5781        Tommy Burleson      223.0          USA
5894            Mel Counts      213.0          USA
6106       Marc Freiberger      211.0          USA
6281        Darrall Imhoff      211.0          USA
6379            Joe Kleine      211.0          USA
6393            Jon Koncak      213.0          USA
6442    Christian Laettner      211.0          USA
6615          Tom McMillen      212.0          USA
6722      Shaquille O'Neal      216.0          USA
6937        David Robinson      216.0          USA
7012       Daniel Santiago      213.0          USA
112319         Chris Kaman      213.0          USA
112366       Dwight Howard      211.0          USA
118573     Al-Farouq Aminu      211.0          USA
123850      Tyson Chandler      216.0          USA
132188    Domantas Sabonis      211.0          USA
133332      DeAndre Jordan      211.0          USA
142044       Jahlil Okafor      211.0          USA
142930          Mike Tobey      213.0          USA
143712        JaVale McGee      213.0          USA